# Теперь немного умных слов

# Класс (Class): Определенный программистом протатип программируемого
# объекта с набором атрибутов(переменных и методов), которые описывают
# данный объект. Доступ к аттрибутам и методам осуществляется через точку

# Переменная класса (Class Variable): Переменная, доступная для всех экземпляров данного
# класса. Определяется внутри класса, но вне любых методов класса.

# Экземпляр класса (Instance): Отдельный объект - представитель определенного класса.

# Переменная экземпляра класса (Instance Variable): Переменная определенная внутри
# метода класса, принадлежащая только к этому классу.

# Метод(Method): Особая функция, определенная внутри класса.

# Наследование(Inheritance): Передача атрибутов и методов родительского класса дочерним
# классам.

# Перегрузка функций(Function overloading): Изменение работы метода, унаследованного
# дочерним классом от родительского класса.

# Пергрузка операторов(Operator overloading): Определение работы операторов с экземплярами
# данного класса.


# Если хочется ещё крутой теории - https://goo.gl/9JxMcn

# Изученные нами принципы ОПП
#       абстракция - выделение класов объекта
#       наследование - иерархия классов
#       инкапсуляция - сокрытие данных внутри объекта
#       полиморфизм - множественное наследование
